{
  "common": {
    "home": "Home",
    "menu": "Menu",
    "reservation": "Reservation",
    "contact": "Contact",
    "about": "About",
    "catering": "Catering",
    "orderOnline": "Order Online"
  },
  "footer": {
    "contact": "Contact Us",
    "openingHours": "Opening Hours",
    "monFri": "Monday - Friday",
    "satSun": "Saturday - Sunday",
    "quickLinks": "Quick Links",
    "followUs": "Follow Us",
    "allRightsReserved": "All rights reserved."
  },
  "privacy": {
    "title": "Privacy Policy",
    "description": "Privacy Policy and data protection information for Dal Rotti Restaurant customers",
    "lastUpdated": "Last updated: January 1, 2023",
    "sections": {
      "introduction": {
        "title": "Introduction",
        "content": "At Dal Rotti, we respect your privacy and are committed to protecting your personal data. This privacy policy will inform you about how we look after your personal data when you visit our website and tell you about your privacy rights and how the law protects you."
      },
      "dataCollection": {
        "title": "Data We Collect",
        "content": "We may collect, use, store and transfer different kinds of personal data about you which we have grouped together as follows:",
        "items": "Identity Data includes first name, last name, username or similar identifier.|Contact Data includes billing address, delivery address, email address and telephone numbers.|Financial Data includes payment card details.|Transaction Data includes details about payments to and from you and other details of products and services you have purchased from us.|Technical Data includes internet protocol (IP) address, your login data, browser type and version, time zone setting and location, browser plug-in types and versions, operating system and platform, and other technology on the devices you use to access this website."
      },
      "dataUse": {
        "title": "How We Use Your Data",
        "content": "We will only use your personal data when the law allows us to. Most commonly, we will use your personal data in the following circumstances:",
        "items": "Where we need to perform the contract we are about to enter into or have entered into with you.|Where it is necessary for our legitimate interests (or those of a third party) and your interests and fundamental rights do not override those interests.|Where we need to comply with a legal obligation."
      },
      "dataSecurity": {
        "title": "Data Security",
        "content": "We have put in place appropriate security measures to prevent your personal data from being accidentally lost, used or accessed in an unauthorized way, altered or disclosed. In addition, we limit access to your personal data to those employees, agents, contractors and other third parties who have a business need to know."
      },
      "dataRetention": {
        "title": "Data Retention",
        "content": "We will only retain your personal data for as long as reasonably necessary to fulfill the purposes we collected it for, including for the purposes of satisfying any legal, regulatory, tax, accounting or reporting requirements."
      },
      "rights": {
        "title": "Your Legal Rights",
        "content": "Under certain circumstances, you have rights under data protection laws in relation to your personal data, including:",
        "items": "Request access to your personal data.|Request correction of your personal data.|Request erasure of your personal data.|Object to processing of your personal data.|Request restriction of processing your personal data.|Request transfer of your personal data.|Right to withdraw consent."
      },
      "changes": {
        "title": "Changes to This Privacy Policy",
        "content": "We may update our privacy policy from time to time. We will notify you of any changes by posting the new privacy policy on this page and updating the 'last updated' date at the top of this privacy policy."
      },
      "contact": {
        "title": "Contact Us",
        "content": "If you have any questions about this privacy policy or our privacy practices, please contact us at:",
        "phone": "Phone",
        "address": "Address"
      }
    },
    "dataCollection": {
      "title": "Data Collection",
      "description": "We collect certain information when you use our services. This information helps us provide and improve our services.",
      "items": {
        "personal": "Personal information (name, address)",
        "contact": "Contact information (email, phone number)",
        "preferences": "Dining preferences and dietary requirements"
      }
    },
    "dataUse": {
      "title": "How We Use Your Data",
      "description": "We use your data to provide and improve our services in the following ways:",
      "items": {
        "orders": "Process your orders and reservations",
        "communication": "Communicate with you about our services",
        "improvement": "Improve our services and customer experience"
      }
    },
    "dataSecurity": {
      "title": "Data Security",
      "description": "We implement appropriate security measures to protect your personal information from unauthorized access, alteration, or disclosure."
    },
    "cookies": {
      "title": "Cookies",
      "description": "We use cookies to enhance your browsing experience and analyze website traffic. You can control cookie settings through your browser preferences."
    },
    "rights": {
      "title": "Your Rights",
      "description": "You have certain rights regarding your personal data:",
      "items": {
        "access": "Right to access your personal data",
        "rectification": "Right to correct inaccurate data",
        "deletion": "Right to request deletion of your data",
        "restriction": "Right to restrict processing of your data"
      }
    },
    "contact": {
      "title": "Contact Us",
      "description": "If you have any questions about our privacy policy or how we handle your data, please contact us."
    }
  },
  "terms": {
    "title": "Terms of Service",
    "description": "Terms of Service and conditions for using Dal Rotti Restaurant services",
    "acceptance": {
      "title": "Acceptance of Terms",
      "description": "By accessing and using our services, you agree to be bound by these terms and conditions."
    },
    "services": {
      "title": "Our Services",
      "description": "We provide the following services:",
      "items": {
        "dineIn": "Dine-in restaurant services",
        "takeaway": "Takeaway orders",
        "delivery": "Food delivery",
        "catering": "Catering services"
      }
    },
    "reservations": {
      "title": "Reservations",
      "description": "Our reservation policy includes:",
      "items": {
        "booking": "Online and phone booking available",
        "cancellation": "24-hour cancellation notice required",
        "modification": "Modifications subject to availability"
      }
    },
    "pricing": {
      "title": "Pricing",
      "description": "All prices are in euros and include applicable taxes. Prices may change without prior notice."
    },
    "payment": {
      "title": "Payment",
      "description": "Payment terms and conditions:",
      "items": {
        "methods": "We accept cash, credit cards, and digital payments",
        "security": "All online payments are secure and encrypted",
        "refunds": "Refund policy applies as per local regulations"
      }
    },
    "liability": {
      "title": "Liability",
      "description": "We strive to provide the best service but cannot be held liable for circumstances beyond our reasonable control."
    },
    "contact": {
      "title": "Contact Information",
      "description": "For any questions about these terms, please contact us."
    }
  }
}
